Part 5/CarService/CarClient/App_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T06:47:37.8720761Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{fc3313f1-90b9-44f4-83c1-382315707643}" /><Execution ProcessName="CarClient" ProcessID="6372" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T09:47:37.8720761+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ICarService/GetCar</Action><To>http://localhost:8080/CarService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/E4aDV8DfhPhVVE/c63uEEAAAAAQmrOKAstRE625rnyxeBTAaI0zGRYYxJIoBA2hH/ufeIACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="bd2a34d0-f33a-47f3-8120-a2cb7a0ce029" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetCar xmlns="http://tempuri.org/"><id>1</id></GetCar></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-12-19T06:47:37.9020773Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{fc3313f1-90b9-44f4-83c1-382315707643}" /><Execution ProcessName="CarClient" ProcessID="6372" ThreadID="1" /><Channel/><Computer>KPO8546</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-12-19T09:47:37.9020773+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>383</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Tue, 19 Dec 2017 06:47:37 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetCarResponse xmlns="http://tempuri.org/"><GetCarResult xmlns:a="http://schemas.datacontract.org/2004/07/CarService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Id>1</a:Id><a:Model>Versa</a:Model><a:Vendor>Toyota</a:Vendor><a:Year>2014</a:Year></GetCarResult></GetCarResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>